[
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: F-47 Maintenance ERP - Initial Discussion Hi Team, As we discussed briefly last week, we need to kick oﬀ the eﬀort to define the requirements for the new F-47 Maintenance ERP system. Given the strategic importance of this program, we'll be pursuing a GOTS (Government Oﬀ-The-Shelf) approach where applicable. Matthew, I'd like to get your input from the Program Oﬃce perspective on the high-level needs. Matt, from a technical standpoint, what are your initial thoughts on the feasibility of a GOTS solution given the existing systems and potential integration points? John and Jane, your experience in SW development and Logistics, respectively, will be crucial in understanding the practical implications of any requirements we define. Let's aim to have a draft requirement document ready within the next two weeks. Please come prepared to discuss specific functionalities, data requirements, and potential challenges. Thanks, Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Initial Discussion Jude, Thanks for kicking this oﬀ. From the Program Oﬃce perspective, our primary need is improved operational readiness for the F-47 fleet. This translates to: • Reduced downtime: We need faster maintenance turnaround times. • Improved parts availability: Less waiting on parts. • Better data visibility: We need a clear picture of maintenance schedules, parts usage, and overall fleet health. We've had issues in the past with disparate systems that don't talk to each other. This new ERP MUST be able to integrate with our existing flight scheduling system (FSS) and the supply chain management system (SCMS). I'm also concerned about security. This system will handle sensitive data, so security needs to be a paramount consideration. Let me know if you need any further clarification. Matthew Roberts Branch Chief/PM",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Initial Discussion Jude and Matthew, From a technical standpoint, a GOTS solution is definitely feasible, but it will require careful evaluation and potentially significant customization. We need to identify a GOTS product that oﬀers the core functionalities we need and is flexible enough to be adapted to our specific requirements. Integration with the FSS and SCMS will be a major challenge. Both of those systems are legacy systems and have limited API capabilities. We'll need to explore options for either developing custom interfaces or potentially upgrading those systems as well. Data migration is another concern. We have a large amount of historical maintenance data stored in various formats. We'll need a robust data migration strategy to ensure that all of this data is transferred to the new ERP system accurately and eﬃciently. Finally, we need to consider the long-term maintainability of the system. We need to choose a GOTS product that is actively supported and has a clear roadmap for future updates and enhancements. Thanks, Matt Nelson CTO",
    "From: John Doe john.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Initial Discussion Team, Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com Subject: Re: F-47 Maintenance ERP - Initial Discussion Adding my two cents from a SW engineer perspective: The integration with FSS and SCMS is a legit concern. I took a look at the systems last year for a diﬀerent project and they both use very dated tech. We'll need to spend some time to understand how the systems push and pull data for the older interfaces to have a solid integration. Also, consider that if we are going GOTS, we will need to build up our integration testing suites around the GOTS ERP's exposed features so that there is confidence any change to the GOTS ERP doesn't break other integrations. We may need a dedicated team and resources for this work. Thanks, John Doe SW Engineer",
    "From: Jane Doe jane.doe@example.com To: Jude Stanley jude.stanley@example.com , All, From the logistics side, improved parts availability is paramount. We spend way too much time tracking down parts across diﬀerent depots. The ERP must provide real-time visibility into parts inventory levels and locations. It also needs to automate the ordering process to ensure that we maintain adequate stock levels. Another key requirement is the ability to track the entire maintenance lifecycle of each part, from installation to removal. This will help us identify trends and proactively address potential issues. Finally, the system needs to be able to generate reports that provide insights into parts usage, cost, and availability. These reports will be critical for making informed decisions about inventory management. Jane Doe Logistics",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: F-47 Maintenance ERP - Downtime Reduction - Let's Get Specific Team, Okay, let's focus on a specific requirement: Reduced Downtime . Matthew, you mentioned this as a primary need. Can you quantify this? What is our current average downtime per F-47, and what is our target? Also, what are the key drivers of downtime? Is it parts availability, diagnostic time, repair time, or something else? Matt, from a technical perspective, what features or functionalities in the ERP would directly contribute to reducing downtime? John, could we build a monitoring tool to help ensure downtime is tracked and displayed correctly? Jane, your insight into parts availability is critical here. What improvements in the ERP would have the biggest impact on reducing parts-related downtime? Thanks, Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Downtime Reduction - Let's Get Specific Jude, Currently, our average downtime per F-47 is 72 hours per month . Our target is to reduce this to 48 hours per month within one year of the ERP system being fully operational. The key drivers of downtime are a combination of factors: • Parts availability (30%): As Jane mentioned, waiting on parts is a significant issue. • Diagnostic time (25%): Identifying the root cause of the problem can be time- consuming. • Repair time (30%): Actually fixing the problem. • Paperwork/Admin (15%): The lag time between the work complete and system reporting is another source of downtime. Matthew Roberts Branch Chief/PM",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Downtime Reduction - Let's Get Specific Okay, with those drivers in mind, the ERP needs the following: • Real-time inventory management: To address parts availability. • Predictive maintenance capabilities: To anticipate potential failures and schedule maintenance proactively, reducing diagnostic time. This would require integration with sensor data from the F-47s (if available) and advanced analytics. • Automated workflow for maintenance tasks: To streamline the repair process and reduce administrative overhead. This should include electronic sign-oﬀs and real-time status updates. • Digital twin capabilities: To assist with finding the root cause of the problem. We should also investigate integrating AI-powered diagnostics to speed up troubleshooting. Matt Nelson CTO",
    "From: John Doe john.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Downtime Reduction - Let's Get Specific Yes, we can definitely build a monitoring tool. We can pull data from the ERP to track downtime metrics and display them in a dashboard. We can also set up alerts to notify us when downtime exceeds certain thresholds. The tool should display a summary of downtime and metrics to help us track progress toward the monthly metrics the team set. John Doe SW Engineer",
    "From: Jane Doe jane.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com Subject: Re: F-47 Maintenance ERP - Downtime Reduction - Let's Get Specific The biggest impact on parts-related downtime would come from: • Automated ordering: The system should automatically generate purchase orders when inventory levels fall below a certain threshold. • Real-time visibility into depot inventory: We need to know exactly where each part is located at any given time. • Improved demand forecasting: We need to be able to predict future parts needs based on historical data and planned maintenance schedules. The system should also factor in the current operational tempo, as this drastically changes demand. • Automated discrepancy reporting: The system should make it easy to report inventory shortages, and identify the root causes. Jane Doe Logistics",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Team, Excellent input. Let's try to consolidate this into a SMART (Specific, Measurable, Achievable, Relevant, Time-bound) requirement. Here's my attempt: The F-47 Maintenance ERP system shall reduce the average downtime per F-47 aircraft from the current 72 hours per month to 48 hours per month within one year of the system's full operational deployment. This will be achieved through: • Real-time inventory management of parts, enabling automated ordering and depot visibility. • Predictive maintenance capabilities, integrating sensor data and advanced analytics to anticipate failures. • Automated workflows for maintenance tasks, including electronic sign-oﬀs and real- time status updates. • Implementation of an uptime monitoring tool. This reduction will be measured by tracking the average downtime per aircraft per month as reported by the ERP system. What are your thoughts? Is this specific enough? Is it measurable? Is it achievable given the constraints? Is it relevant to our overall goals? Is the timeframe realistic? How can we improve it? Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Jude, I think this is a good starting point. However, I have a few suggestions: • \"Full operational deployment\" needs to be defined more precisely. Does this mean all F-47s are using the system? Does it mean all modules of the ERP are implemented? • The measurement needs to be auditable. We can't just rely on the ERP's reporting. We need to have a process in place to verify the accuracy of the data. • Add a penalty for non-compliance. This is a strategic objective. Matthew Roberts Branch Chief/PM",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Regarding the predictive maintenance piece, we should add some detail about the data sources used. I suggest: \"Predictive maintenance capabilities, integrating F-47 sensor data (where available), maintenance history, and flight operational data and advanced analytics to anticipate failures. \" Also, it would be helpful to include acceptance criteria. Matt Nelson CTO",
    "From: John Doe john.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal For the monitoring tool add: \"Implementation of an uptime monitoring tool which can be configured to notify key team members when downtime thresholds are approached. \" John Doe SW Engineer",
    "From: Jane Doe jane.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Agree with Matt, the acceptance criteria is helpful! Perhaps for my piece it could be something like: \"Real-time inventory management of parts, enabling automated ordering and depot visibility, with a target of 95% inventory accuracy . Jane Doe Logistics",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , John Doe \" john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Okay, based on your feedback, here's the revised requirement: The F-47 Maintenance ERP system shall reduce the average downtime per F-47 aircraft from the current 72 hours per month to 48 hours per month within one year of full operational deployment . Full operational deployment is defined as the point where all F-47 aircraft maintenance activities are being managed through the ERP system across all relevant modules. This will be achieved through: • Real-time inventory management of parts, enabling automated ordering and depot visibility, with a target of 95% inventory accuracy . • Predictive maintenance capabilities, integrating F-47 sensor data (where available), maintenance history, and flight operational data and advanced analytics to anticipate failures. • Automated workflows for maintenance tasks, including electronic sign-oﬀs and real- time status updates. • Implementation of an uptime monitoring tool which can be configured to notify key team members when downtime thresholds are approached. *This reduction will be measured by tracking the average downtime per aircraft per month as reported by the ERP system. Data accuracy will be validated through monthly audits of a randomly selected sample of maintenance records. Failure to achieve this goal will result in a re- evaluation of the ERP system's configuration and potential further customization to address identified shortcomings. \" * Does this address everyone's concerns? Are we ready to move forward with this requirement? Thanks, Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Looks good to me! Let's move forward. Matthew Roberts",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , John Doe john.doe@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Approved! Matt Nelson",
    "From: John Doe john.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com , Jane Doe jane.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Ok John Doe",
    "From: Jane Doe jane.doe@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com , John Doe john.doe@example.com Subject: Re: F-47 Maintenance ERP - Refining Downtime Requirement - SMART Goal Approved. Jane Doe Key Considerations for Your LLM Automation: • Prompt Engineering: The LLM needs to be instructed to identify the intention behind the emails, not just the literal words. Tell it to extract the desired requirement. Requirement - SMART Goal • Context Window: Make sure your LLM has a large enough context window to handle the full email threads. • Fine-tuning: If possible, consider fine-tuning the LLM on similar email threads and existing SMART requirements to improve its performance. • Quality Control: Always have a human review the requirements generated by the LLM. It's a tool to assist, not replace, human judgment. • Iterative Refinement: The LLM's performance will likely improve over time as you provide feedback and refine its training data. This set of emails should provide a good starting point for your automation exercise. Good luck! Let me know if you have further requests, and I can help you build more email chains.",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com Subject: F-47 AI- Powered Log & Supply ERP - Kickoﬀ Hi Matthew and Matt, I've been asked to start a discussion with you two to develop a requirement for an AI custom- built log and supply ERP software application to support the new F-47 aircraft. To start the discussion, I think it lays out like this: 1. 2. 3. 4. 5. It will need to be a cloud-based application. Relational database that connects modules together that support end-to-end business processes documented in the BTA End-to-End (E2E) documentation. It will need to be Defense Logistics Management System compliant (DLMS). Potential user count will be around 5000 at any given time. It will need to support CONUS and OCONUS operations and integrate with FMS partners that we project will procure the F-47 at some point in the future. 6. We expect it to be FIAR compliant. 7. We expect the entire software and architecture to be built by AI Agents, integrating human-in-the-loop confirmation as needed. 8. We expect this to be developed using modern technology, including software coding language. 9. We expect automations to accomplish unit testing, integration testing, and operational testing. 10. We expect training material to be built that is both traditional (e.g., paper and class- supported) but also CBT with the computer-based concept being AI Agent Agentic training agents. This will get us started. What am I missing? Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com Subject: Re: F-47 AI- Powered Log & Supply ERP - Kickoﬀ Jude, Thanks for initiating this. A few initial thoughts from my side: • AI Agent Integration: I agree that the AI agent-driven development is innovative, but we need to carefully consider the governance and security implications. How do we ensure the AI agents are building a secure and compliant system? • Modern Tech: \"Modern technology\" is pretty vague. What specific technologies are you envisioning? We need to be careful to not pick technologies that are experimental and diﬃcult to support long-term. • Integration with FMS Partners: This is a good goal, but it's a complex one. We need to consider data sharing agreements, security protocols, and potential language barriers. • Scalability : 5000 is probably right to start. The application needs to be able to handle larger user counts and more activity. I'm sure Matt has some detailed tech questions, but those are my initial thoughts. Matthew Roberts Branch Chief/PM",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com Subject: Re: F-47 AI-Powered Log & Supply ERP - Kickoﬀ Jude and Matthew, My thoughts are primarily around the technical feasibility and security of this. • AI Agent Security: Agree with Matthew. What security protocols and checks will be in place to avoid malicious code, code exploits, or vulnerabilities? • Data Storage and Architecture: The relational database piece is understood. How will the data be secured, what are the expected up-time requirements and disaster recovery capabilities? • AI Agents : What AI \"Agents\" will be used, and the API's or connection methods? • CBT: AI Agent agentic training agents sounds awesome. How would the AI adjust based on the training eﬀectiveness for the specific user to individualize the training experience? Matt Nelson CTO",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com Subject: Re: F-47 AI- Powered Log & Supply ERP - Digging Deeper Matthew and Matt, Excellent points. Let's try to address some of these concerns: • AI Agent Security: We'll need a comprehensive security framework for the AI agents, including code scanning, vulnerability testing, and human oversight of critical decisions. Perhaps we should use a zero trust architecture. • Modern Tech: We should prioritize cloud-native technologies (e.g., containers, microservices, serverless computing). We should also consider using a low-code/no-code platform to accelerate development. • Integration with FMS Partners: We need to start discussions with our FMS partners to understand their data requirements and security protocols. • AI Agents Details: We should be using state of the art AI model(s). They should be trained on security. • Data Storage & Architecture: We should have disaster recovery as a secondary site. • Scalability : The application needs to scale. We can set this up in the cloud to do it. What about specific functions that the application will provide? Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com Subject: Re: F-47 AI- Powered Log & Supply ERP - Functions and Features Jude, Let's consider some core functions the system must perform. The goal should be to reduce the logistical footprint and cost of each aircraft. This can be done via: • Predictive Maintenance: Forecasts the need for maintenance to reduce downtime. • Automated Supply Chain Management: Automatically orders parts and reduces human interaction. • Real Time Analytics: Real time data feeds to drive better insights. Also, can we confirm the data requirements to the system? What are the most critical aspects of the data to consider? Matthew Roberts Branch Chief/PM",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com Subject: Re: F-47 AI-Powered Log & Supply ERP - Functions and Features Jude and Matthew, Echoing Matthew's thoughts on the analytics platform. One more request: • AI-Driven Threat Hunting . The analytics platform should be able to threat hunt. On the data aspect of this: • How often will the models be retrained? • What AI models will be used? Matt Nelson CTO",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com Subject: F-47 AI- Powered Log & Supply ERP - Adding More Detail (Partially SMART) Team, Okay, let's continue to refine this. Let's try to make one requirement a bit more Specific and Measurable, but still missing the Time-bound element: The AI-powered Log & Supply ERP system shall reduce the average logistical cost per flight hour of the F-47 aircraft by 15% compared to the current baseline. This will be achieved through: • AI-driven predictive maintenance, utilizing sensor data and machine learning algorithms to forecast maintenance needs. • Automated supply chain management, automatically generating purchase orders and optimizing inventory levels. • Real-time analytics, providing users with actionable insights into logistical performance. The reduction in logistical cost per flight hour will be measured by comparing the average cost over a three-month period after implementation to the average cost over a comparable three- month period before implementation. Thoughts? How can we make the requirements more measurable and specific? How can we start measuring this? Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com Subject: Re: F-47 AI- Powered Log & Supply ERP - Adding More Detail (Partially SMART) Jude, Good progress! A few comments: • Baseline Definition: The \"current baseline\" needs to be clearly defined. What data sources will be used to establish the baseline? Which costs will be included? This can be refined more for clarity. • AI Agent oversight : Who approves/denies the decisions the AI makes? Matthew Roberts Branch Chief/PM",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com Subject: Re: F-47 AI-Powered Log & Supply ERP - Adding More Detail (Partially SMART) Jude and Matthew, One key aspect is the integration of systems. • Where does the baseline data come from? • What is the reliability of the data? Matt Nelson CTO",
    "From: Jude Stanley jude.stanley@example.com To: Matthew Roberts matthew.roberts@example.com , Matt Nelson matt.nelson@example.com Subject: F-47 AI- Powered Log & Supply ERP - Fully SMART Requirement Team, Okay, let's finalize this requirement and make it fully SMART. Taking into account your feedback, here is the final version: The AI-powered Log & Supply ERP system shall reduce the average logistical cost per flight hour of the F-47 aircraft by 15% compared to the current baseline within 18 months of the system's full operational deployment . This will be achieved through: • AI-driven predictive maintenance, utilizing sensor data from the F-47 aircraft and machine learning algorithms to forecast maintenance needs with at least 90% accuracy. • Automated supply chain management, automatically generating purchase orders and optimizing inventory levels with human in the loop approval within 24 hours. • Real-time analytics, providing users with actionable insights into logistical performance. The current baseline is defined as the average logistical cost per flight hour for the three- month period prior to the system's initial deployment, as measured by data from the existing [Name of Existing System] system . Logistical costs include parts, labor, transportation, and inventory holding costs . The reduction in logistical cost per flight hour will be measured by comparing the average cost over a three-month period after implementation to the baseline cost. This will happen 18 months after deployment. Does this address everyone's concerns and establish a fully SMART requirement? Jude Stanley PM/CTO",
    "From: Matthew Roberts matthew.roberts@example.com To: Jude Stanley jude.stanley@example.com , Matt Nelson matt.nelson@example.com Subject: Re: F-47 AI- Powered Log & Supply ERP - Fully SMART Requirement Jude, Looks good to me. I approve of the specific timelines now! Matthew Roberts",
    "From: Matt Nelson matt.nelson@example.com To: Jude Stanley jude.stanley@example.com , Matthew Roberts matthew.roberts@example.com Subject: Re: F-47 AI-Powered Log & Supply ERP - Fully SMART Requirement Approved Matt Nelson Key Takeaways for your LLM: • Track the Evolution: Your LLM needs to be able to trace how the requirement evolved over time. • Identify Missing Elements: The LLM should be able to identify which parts of the SMART acronym are initially missing and how they are subsequently added. • Context is King: The LLM needs to understand the context of each email to accurately extract the requirement."
]
